In [1]:
print("Ok")

Ok

In [2]:
print("Maithily is sexy")

Maithily is sexy

In [3]:
print("Maithily is sexy")

Maithily is sexy

In [ ]:
''' connection string of mangodb data
mongodb+srv://mangeshg1408:abc123ABC@cluster0.dhyrxco.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0

'''

' connection string of mangodb data\nmongodb+srv://mangeshg1408:<db_password>@cluster0.dhyrxco.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0\n\n'

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("Visadataset.csv")
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [7]:
df.shape

(25480, 12)

In [8]:

df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [9]:
data = df.to_dict(orient='records')

In [15]:
DB_NAME = "US_VISA"
COLLECTION_NAME = "visa_data"
CONNECTION_URL = "mongodb+srv://mangeshg1408:abc123ABC@cluster0.dhyrxco.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0"

In [11]:
import pymongo

In [16]:
client = pymongo.MongoClient(CONNECTION_URL)
data_base = client[DB_NAME]
collection = data_base[COLLECTION_NAME]
# rec = collection.insert_many(data)

In [18]:
records = collection.find()
records

In [19]:
import pandas as pd
df = pd.DataFrame(list(collection.find()))

In [20]:
df.head()

,_id,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,688c21f4fe5f3ff0a854ec88,EZYV62,Europe,Doctorate,Y,Y,2311,1994,Midwest,58791.58,Year,Y,Certified
1,688c21f4fe5f3ff0a854ec95,EZYV75,Africa,Master's,Y,N,3705,2001,South,47170.76,Year,Y,Certified
2,688c21f4fe5f3ff0a854eca3,EZYV89,Asia,Bachelor's,N,N,2543,1939,Northeast,78893.64,Year,Y,Denied
3,688c21f4fe5f3ff0a854ecd1,EZYV135,Asia,Doctorate,Y,Y,113282,2011,Midwest,164893.00,Year,Y,Certified
4,688c21f4fe5f3ff0a854ed2e,EZYV228,Asia,High School,Y,N,503,1998,Midwest,118458.61,Year,Y,Certified

In [21]:
if "_id" in df.columns.to_list():
    df = df.drop(columns=["_id"], axis=1)

In [22]:
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV62,Europe,Doctorate,Y,Y,2311,1994,Midwest,58791.58,Year,Y,Certified
1,EZYV75,Africa,Master's,Y,N,3705,2001,South,47170.76,Year,Y,Certified
2,EZYV89,Asia,Bachelor's,N,N,2543,1939,Northeast,78893.64,Year,Y,Denied
3,EZYV135,Asia,Doctorate,Y,Y,113282,2011,Midwest,164893.00,Year,Y,Certified
4,EZYV228,Asia,High School,Y,N,503,1998,Midwest,118458.61,Year,Y,Certified